
# Команда strace

Если ни один из предыдущих методов не показал файл конфигурации, вы можете использовать strace, чтобы отследить, какой файл открывается Zabbix Agent. Для этого выполните следующие действия:
1. Найдите PID процесса Zabbix Agent:
Bash


pidof zabbix_agentd
1. Используйте strace для наблюдения за системой:
Bash


sudo strace -p <PID>

Замените <PID> идентификатором процесса, полученным на предыдущем шаге. В выводе вы сможете увидеть системные вызовы, включая открытие файлов.

Обратите внимание на строки, которые начинаются с open(; среди них должен быть путь к файлу конфигурации.
